CodeigniterPrueba/app/Controllers/Articulo.php

INSERT INTO `articulo` (`title`, `descripcion`, `cuerpo`) VALUES ('Redbull da diabetes', 'Es broma pero es mucho mejor la que no tiene azucar.', 'Es broma, si que da diabetes.')
---
    public function create(){
        $model = new ArticuloModel();
        if ($this->request->getMethod() === 'post' //&& $this->validate([
            //'title' => 'required|min_length[3]|max_length[255]',
            //'descripcion' => 'required',
            //'cuerpo' => 'required'])
        ){
            $model->save([
            'title' => $this->request->getPost('title'),
            'descripcion' => $this->request->getPost('descripcion'),
            'cuerpo' => $this->request->getPost('cuerpo'),
        ]);