CodeigniterPrueba/app/Controllers/Usuario.php

    public function create(){
        $model = new UsuarioModel();
        if ($this->request->getMethod() === 'post')
        {
            $model->save([
            'name' => $this->request->getPost('name'),
            'correo' => $this->request->getPost('correo'),
            'user' => $this->request->getPost('user'),
            'pass' => $this->request->getPost('pass'),
            'pass2' => $this->request->getPost('pass2')
            ]);
---
INSERT INTO `usuario` (`name`, `correo`, `user`, `pass`, `pass2`) VALUES ('Raul ', 'raularcosherrera@gmail.com', 'raularcos', 'patata', 'patata')