CodeigniterPrueba/app/Models/UsuarioModel.php

SELECT *
FROM `usuario`
WHERE `user` = 'raularcos'
 LIMIT 1
---
    public function getUser($u)
    {
        return $this->asArray()
                    ->where(['user' => $u])
                     ->first();